app/app/Models/NSiteModel.php

    public function getMenuPages(int $parent = 0): array
    {
        return $this->where('publish', 1)
            ->where('show_in_menu', 1)
            ->where('parent', $parent)
            ->orderBy('priority', 'ASC')
            ->findAll();
---
SELECT *
FROM `n_site`
WHERE `publish` = 1
AND `show_in_menu` = 1
AND `parent` = 0
ORDER BY `priority` ASC